In [2]:
print('Hello World')   # Shift Enter

Hello World

In [3]:
num1 = 45
num2 = 55
add = num1 + num2
print('Addition is', add)

Addition is 100

In [4]:
type(num1)

int

In [5]:
num = [56, 23, 11, 67, 87,33, 13,18]

In [6]:
num

[56, 23, 11, 67, 87, 33, 13, 18]

In [7]:
type(num)

list

In [8]:
num[3]

67

##### Array

In [9]:
import numpy as np

In [10]:
x = np.array([67,33,12,54,27,58,99])

In [11]:
x

array([67, 33, 12, 54, 27, 58, 99])

In [12]:
x.min()

12

##### Series

In [15]:
import pandas as pd

In [16]:
s = pd.Series([45,11,34,26,58,61,40])

In [17]:
s

0    45
1    11
2    34
3    26
4    58
5    61
6    40
dtype: int64

In [18]:
s[2]

34

##### DataFrame

In [20]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series(['Ram','Raj','Riya','Rita','Reema'])
s3 = pd.Series([67.89, 76.45, 71.45, 87.34, 62.01])

In [21]:
df = pd.DataFrame({
    'roll': s1,
    'name': s2,
    'marks': s3
})

In [22]:
df

   roll   name  marks
0     1    Ram  67.89
1     2    Raj  76.45
2     3   Riya  71.45
3     4   Rita  87.34
4     5  Reema  62.01

In [ ]:
https://mitu.co.in/dataset

Download the file -> student.csv

In [23]:
import os
os.getcwd()

'/home/mitu/pcp-1'

In [24]:
df = pd.read_csv('student.csv')
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
df.shape

(10, 5)

In [27]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [28]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [29]:
df.count()

roll     10
name     10
class    10
marks    10
age      10
dtype: int64

In [30]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

##### Data Slicing

In [32]:
x = df.iloc[2:6, 1:4]

In [33]:
x

      name class  marks
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55

In [34]:
df.iloc[:, 1:4]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75
9    anmol    BE  78.66

In [35]:
df.iloc[2:6, :]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20

In [36]:
df.iloc[[2,3,6,8], [1,2,4]]

      name class  age
2   aniket    BE   19
3  ajinkya    TE   20
6     amar    BE   19
8     amol    TE   20

In [37]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [38]:
df[['name','marks','class']]

      name  marks class
0     anil  56.77    TE
1     amit  59.77    TE
2   aniket  76.88    BE
3  ajinkya  69.66    TE
4     asha  63.28    TE
5   ayesha  49.55    BE
6     amar  65.34    BE
7    amita  68.33    BE
8     amol  56.75    TE
9    anmol  78.66    BE

In [39]:
df.drop(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [40]:
df.drop('class', axis = 1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [42]:
df['roll'] + 100

0    101
1    102
2    103
3    104
4    105
5    106
6    107
7    108
8    109
9    110
Name: roll, dtype: int64

In [43]:
df['roll'] = df['roll'] + 100

In [44]:
df

   roll     name class  marks  age
0   101     anil    TE  56.77   22
1   102     amit    TE  59.77   21
2   103   aniket    BE  76.88   19
3   104  ajinkya    TE  69.66   20
4   105     asha    TE  63.28   20
5   106   ayesha    BE  49.55   20
6   107     amar    BE  65.34   19
7   108    amita    BE  68.33   23
8   109     amol    TE  56.75   20
9   110    anmol    BE  78.66   21

In [45]:
df['marks'] = df['marks'] + 0.4

In [46]:
df

   roll     name class  marks  age
0   101     anil    TE  57.17   22
1   102     amit    TE  60.17   21
2   103   aniket    BE  77.28   19
3   104  ajinkya    TE  70.06   20
4   105     asha    TE  63.68   20
5   106   ayesha    BE  49.95   20
6   107     amar    BE  65.74   19
7   108    amita    BE  68.73   23
8   109     amol    TE  57.15   20
9   110    anmol    BE  79.06   21

In [47]:
df['cgpa'] = df['marks'] / 10 + 1.21

In [48]:
df

   roll     name class  marks  age   cgpa
0   101     anil    TE  57.17   22  6.927
1   102     amit    TE  60.17   21  7.227
2   103   aniket    BE  77.28   19  8.938
3   104  ajinkya    TE  70.06   20  8.216
4   105     asha    TE  63.68   20  7.578
5   106   ayesha    BE  49.95   20  6.205
6   107     amar    BE  65.74   19  7.784
7   108    amita    BE  68.73   23  8.083
8   109     amol    TE  57.15   20  6.925
9   110    anmol    BE  79.06   21  9.116

In [49]:
df['first class'] = df['marks'] >= 60

In [50]:
df

   roll     name class  marks  age   cgpa  first class
0   101     anil    TE  57.17   22  6.927        False
1   102     amit    TE  60.17   21  7.227         True
2   103   aniket    BE  77.28   19  8.938         True
3   104  ajinkya    TE  70.06   20  8.216         True
4   105     asha    TE  63.68   20  7.578         True
5   106   ayesha    BE  49.95   20  6.205        False
6   107     amar    BE  65.74   19  7.784         True
7   108    amita    BE  68.73   23  8.083         True
8   109     amol    TE  57.15   20  6.925        False
9   110    anmol    BE  79.06   21  9.116         True

##### Boolean filtering

In [52]:
df['marks'] > 60

0    False
1     True
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: marks, dtype: bool

In [53]:
df[df['marks'] > 60]

   roll     name class  marks  age   cgpa  first class
1   102     amit    TE  60.17   21  7.227         True
2   103   aniket    BE  77.28   19  8.938         True
3   104  ajinkya    TE  70.06   20  8.216         True
4   105     asha    TE  63.68   20  7.578         True
6   107     amar    BE  65.74   19  7.784         True
7   108    amita    BE  68.73   23  8.083         True
9   110    anmol    BE  79.06   21  9.116         True

In [55]:
x = df[(df['marks'] > 60) & (df['class'] == 'BE')]

In [56]:
x

   roll    name class  marks  age   cgpa  first class
2   103  aniket    BE  77.28   19  8.938         True
6   107    amar    BE  65.74   19  7.784         True
7   108   amita    BE  68.73   23  8.083         True
9   110   anmol    BE  79.06   21  9.116         True

##### Export the data

In [58]:
x.to_csv('output.csv', index=False)

In [59]:
df.sort_values(by='marks')

   roll     name class  marks  age   cgpa  first class
5   106   ayesha    BE  49.95   20  6.205        False
8   109     amol    TE  57.15   20  6.925        False
0   101     anil    TE  57.17   22  6.927        False
1   102     amit    TE  60.17   21  7.227         True
4   105     asha    TE  63.68   20  7.578         True
6   107     amar    BE  65.74   19  7.784         True
7   108    amita    BE  68.73   23  8.083         True
3   104  ajinkya    TE  70.06   20  8.216         True
2   103   aniket    BE  77.28   19  8.938         True
9   110    anmol    BE  79.06   21  9.116         True